{
  "latestVersion": "0.6.0",
  "versions": [
    {
      "version": "0.6.0",
      "date": "2026-01-31",
      "highlight": "Anime airing schedule and share your favorite anime with friends.",
      "sections": [
        {
          "type": "New",
          "items": [
            "Anime Airing Schedule page - see what's airing each day of the week",
            "Schedule tab in navigation for quick access",
            "Share anime and manga with friends via native share menu",
            "Floating action button now animates smoothly on scroll"
          ]
        },
        {
          "type": "Improved",
          "items": [
            "FAB collapses to a perfect circle when scrolling down",
            "Smoother spring animations on the Add to List button",
            "Profile page now has a gradient navbar like other tabs"
          ]
        }
      ]
    },
    {
      "version": "0.5.0",
      "date": "2026-01-28",
      "highlight": "User activity tracking with MAL images and personalized status badges.",
      "sections": [
        {
          "type": "New",
          "items": [
            "User activity section showing recent watched episodes and read chapters",
            "Recent updates section displaying list status changes",
            "Thumbnail images from MyAnimeList for activity cards",
            "Reusable StatusBadge component mapping status to icons and colors",
            "Enhanced skeleton loaders matching thumbnail dimensions"
          ]
        },
        {
          "type": "Improved",
          "items": [
            "Profile page with proper bottom padding using navbar height",
            "Parallel image fetching for better performance",
            "Blur effect borders on thumbnails for visual polish",
            "Consistent use of Design System tokens for colors and spacing"
          ]
        }
      ]
    },
    {
      "version": "0.4.0",
      "date": "2026-01-28",
      "highlight": "Settings customization and immersive haptic feedback for every interaction.",
      "sections": [
        {
          "type": "New",
          "items": [
            "Settings toggles to customize your app experience",
            "Suggested Anime section toggle - show or hide recommendations on the Anime home page",
            "App-Wide Haptics toggle - enable/disable haptic feedback throughout the app",
            "Haptic feedback on card taps, button presses, tab switches, and more",
            "Persistent settings that survive app restarts"
          ]
        },
        {
          "type": "Improved",
          "items": [
            "Enhanced user interactions with light, medium, and selection haptic feedback",
            "All settings now persist to device storage",
            "Better touch feedback on cards, buttons, and navigation"
          ]
        }
      ]
    },
    {
      "version": "0.3.1",
      "date": "2026-01-27",
      "highlight": "Visual polish and UI consistency improvements across the app.",
      "sections": [
        {
          "type": "Improved",
          "items": [
            "Enhanced blur effects in the bottom tab bar for a cleaner look",
            "Smoother gradient overlays on anime and manga detail screens",
            "Cleaner bottom sheets with hidden scroll indicators",
            "Better visual consistency across iOS and Android"
          ]
        }
      ]
    },
    {
      "version": "0.3.0",
      "date": "2026-01-25",
      "highlight": "New unified header design and improved settings experience.",
      "sections": [
        {
          "type": "New",
          "items": [
            "Redesigned headers with consistent styling across all screens",
            "New icon button design for navigation and actions"
          ]
        },
        {
          "type": "Improved",
          "items": [
            "Settings toggles now use native switch controls for better feel",
            "Improved text readability in your anime/manga lists",
            "Consistent back button style throughout the app"
          ]
        }
      ]
    },
    {
      "version": "0.2.0",
      "date": "2026-01-20",
      "highlight": "Introducing our new component system for a more polished experience.",
      "sections": [
        {
          "type": "New",
          "items": [
            "New button styles with primary, secondary, and ghost variants",
            "Redesigned toggle switches with smoother animations",
            "New text input design with icon support",
            "Improved bottom sheet modals with better gestures"
          ]
        },
        {
          "type": "Improved",
          "items": [
            "More consistent and polished UI elements",
            "Better touch feedback on interactive elements",
            "Smoother animations throughout the app"
          ]
        }
      ]
    },
    {
      "version": "0.1.0",
      "date": "2026-01-15",
      "highlight": "The first release of Niro! Your ultimate anime and manga companion with MyAnimeList integration.",
      "sections": [
        {
          "type": "New",
          "items": [
            "Browse seasonal anime, popular series, and top-ranked shows",
            "Discover popular manga, novels, and manhwa",
            "Search for your favorite anime and manga",
            "View detailed information including synopsis, genres, and trailers",
            "Sign in with your MyAnimeList account",
            "Manage your personal anime and manga lists",
            "Track your watching/reading progress",
            "Rate anime and manga from 0 to 10",
            "Update your watching status (watching, completed, on hold, dropped, plan to watch)",
            "View your profile and statistics",
            "Get personalized anime recommendations",
            "Browse character information for anime",
            "Read and explore user reviews",
            "View image galleries and watch trailers"
          ]
        },
        {
          "type": "Improved",
          "items": [
            "Fast and smooth app performance with smart data loading",
            "Beautiful animations throughout the app",
            "Optimized for both iOS and Android devices",
            "Quick image loading and display"
          ]
        }
      ]
    }
  ]
}
